Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Note that Class() (literally using "Class" in this case) can be used to construct a new Class object based on Class.Prototype.
ja: なお、Class()（ここでは文字通り「Class」を使用）は、Class.Prototypeに基づいて新しいClassオブジェクトを構築するために使用することができます。

source: Note that x is Any would ordinarily be true for any value within AutoHotkey's type hierarchy, but false for COM objects.
ja: 通常、x is AnyはAutoHotkeyの型階層内のどの値に対してもtrueになりますが、COMオブジェクトに対してはfalseになることに注意してください。

source: Note that InStr(FileExist(Pattern), "D") only tells you whether the first matching file is a folder, not whether a folder exists.
ja: InStr(FileExist(Pattern), "D")は、最初にマッチしたファイルがフォルダであるかどうかを示すだけで、フォルダが存在するかどうかを示すものではないことに注意してください。

source: Note that /restart is a built-in switch, so is not included in the array of command-line parameters.
ja: なお、/restartは組み込みのスイッチなので、コマンドラインパラメータの配列には含まれません。

source: Note that x .123 is always property access (not auto-concat) and x+.123 works with or without space.
ja: なお、x .123は常にプロパティアクセス（自動連結ではない）、x+.123はスペースの有無にかかわらず動作します。

source: Note that x.y() is still a method call roughly equivalent to (x.y)(x), but a[i]() is now equivalent to (a[i])().
ja: なお、x.y()は、まだ(x.y)(x)とほぼ同等のメソッド呼び出しですが、a[i]()は(a[i])()と同等になったことに注意してください。

source: Note that AutoHotkey buffers hotkeys in several other ways (such as Thread Interrupt and Critical).
ja: なお、AutoHotkeyは他にもいくつかの方法でホットキーをバッファリングしています（Thread InterruptやCriticalなど）。

source: Note that AutoHotkey buffers hotkeys in several other ways (such as Thread "Interrupt" and Critical).
ja: なお、AutoHotkeyは他にもいくつかの方法でホットキーをバッファリングしています（Thread "Interrupt" and Critical).

source: Note that BlockInput may only work if the script has been run as administrator.
ja: なお、BlockInputは、スクリプトが管理者として実行されている場合にのみ動作する可能性があります。

source: Note that DllCall expects a path with backslashes (\).
ja: なお、DllCallはバックスラッシュを含むパスを想定しています(\)。

source: Note that EndKey returns the "normalized" name of the key regardless of how it was written in EndKeys.
ja: EndKeyは、EndKeysでどのように書かれていたかにかかわらず、キーの「正規化」された名前を返すことに注意してください。

source: Note that INI files accessed with the standard INI functions do not support UTF-8; they must be saved as ANSI or UTF-16.
ja: なお、標準のINI関数でアクセスしたINIファイルはUTF-8をサポートしていませんので、ANSIまたはUTF-16で保存する必要があります。

source: Note that Notepad in Windows 10 version 1903 and later defaults to UTF-8.
ja: なお、Windows 10 バージョン1903以降のメモ帳は、デフォルトでUTF-8に設定されています。

source: Note that SetKeyDelay's second parameter (press duration) is omitted in the hotkeys above.
ja: 上記のホットキーでは、SetKeyDelayの2番目のパラメータ（押す時間）が省略されていることに注意してください。

source: Note that Slow/Fast can be set independently of all the other modes.
ja: Slow/Fastは他のすべてのモードから独立して設定できることに注意。

source: Note that Unicode scripts should begin with a byte-order-mark (BOM), rendering the use of this parameter unnecessary.
ja: Unicodeスクリプトはバイトオーダーマーク（BOM）で始まるべきであるので、このパラメータの使用は不要であることに注意してください。

source: Note that a StartingPos of -1 means the last character in v2, but the second last character in v1.
ja: なお、StartingPosが-1の場合は、v2の最後の文字であり、v1の2番目の最後の文字であることを意味します。

source: Note that a call to MsgBox in an interrupted thread cannot return until the thread is resumed.
ja: 中断されたスレッドでMsgBoxを呼び出すと、スレッドが再開されるまで戻ることができないことに注意してください。

source: Note that a maximized window can be resized without restoring/un-maximizing it, so a value of 1 does not necessarily mean that this event was raised in response to the user maximizing the window.
ja: 最大化されたウィンドウは、復元/最大化解除せずにサイズを変更することができるため、値が1の場合、必ずしもユーザーがウィンドウを最大化したことに応じてこのイベントが発生したことを意味しないことに注意します。

source: Note that a new value would overwrite any dynamic property in this itself, and override any inherited accessor functions.
ja: 新しい値は、this自体の動的プロパティを上書きし、継承されたアクセッサ関数を上書きすることに注意してください。

source: Note that a standard ListBox does not focus an item when it is right-clicked, so this might not be the clicked item.
ja: 標準的なリストボックスでは、右クリックされたときに項目にフォーカスが当たらないので、クリックされた項目でない可能性があることに注意してください。

source: Note that a wildcard check like InStr(FileExist("FolderWithFilesAndSubfolders\*"), "D") only tells you whether the first matching file is a folder, not whether a folder exists.
ja: InStr(FileExist("FolderWithFilesAndSubfolders*"), "D")のようなワイルドカードチェックでは、最初にマッチしたファイルがフォルダであるかどうかがわかるだけで、フォルダが存在するかどうかはわからないことに注意してください。

source: Note that after reassigning the function of a hotstring, its original function can only be restored if it was given a name.
ja: なお、ホットストリングの機能を再割り当てした後、元の機能を復元できるのは、名前が与えられている場合のみです。

source: Note that all properties are processed in alphabetical order, regardless of the order they are specified.
ja: すべてのプロパティは、指定された順番に関係なく、アルファベット順に処理されることに注意してください。

source: Note that although any previous value is freed when a new value is assigned by vref[] or the COM method, the final value is not freed automatically.
ja: なお、vref[]やCOMメソッドで新しい値を代入すると、以前の値はすべて解放されますが、最終的な値は自動的に解放されるわけではありません。

source: Note that although such a script cannot make its own menus transparent, it can make those of other scripts transparent.
ja: このようなスクリプトは、それ自身のメニューを透明にすることはできないが、他のスクリプトのメニューを透明にすることはできることに注意すること。

source: Note that although the Start menu shortcut launches the dash, if it is pinned to the taskbar (or to the Start menu in Windows 7 or 10), the jump list will include any recent scripts launched with the open, runas or UIAccess shell verbs (which are normally accessed via the Explorer context menu or by double-clicking a file).
ja: スタート]メニューのショートカットはDashを起動しますが、タスクバー（またはWindows 7や10では[スタート]メニュー）に固定されている場合、ジャンプリストには[開く]、[runas]、[UIAccess]シェル動詞で起動された最近のスクリプトが含まれることに注意してください（通常、エクスプローラーのコンテキストメニューまたはファイルをダブルクリックしてアクセスします）。

source: Note that any process not designed to run at Realtime priority might reduce system stability if set to that level.
ja: リアルタイム優先で実行するように設計されていないプロセスは、そのレベルに設定するとシステムの安定性を低下させる可能性があることに注意してください。

source: Note that any use of variables will disqualify the expression.
ja: なお、変数を使用した場合は、表現として失格となる。

source: Note that buttons send the BN_CLICKED notification code regardless of whether it has this style.
ja: ボタンは、このスタイルを持っているかどうかに関係なく、BN_CLICKED通知コードを送信することに注意してください。

source: Note that depending on your system settings the ".ahk" part may be hidden, but the file should have an icon like
ja: システム設定によっては、「.ahk」の部分が隠されている場合がありますが、ファイルには次のようなアイコンが表示されます

source: Note that desktop composition is always enabled on Windows 8 and later.
ja: なお、Windows 8以降では、デスクトップ合成は常に有効になっている。

source: Note that due to the x64 calling convention, 64-bit builds never raise this error.
ja: なお、x64の呼び出し規約により、64ビットビルドではこのエラーは発生しない。

source: Note that each script added with this directive will be fully and separately processed by the compiler, and can include further directives.
ja: このディレクティブで追加された各スクリプトは、コンパイラによって完全かつ個別に処理され、さらにディレクティブを含めることができることに注意してください。

source: Note that even if the function is assume-static, a non-static nested function may become a closure if it references a function parameter.
ja: なお、関数がassume-staticであっても、関数パラメータを参照すれば、non-staticの入れ子関数はクロージャになる可能性があります。

source: Note that event handlers may have return values.
ja: なお、イベントハンドラには戻り値がある場合があります。

source: Note that executable file extensions such as .exe can be omitted.
ja: なお、.exeなどの実行ファイルの拡張子は省略可能です。

source: Note that existing directories always have the attribute letter D.
ja: なお、既存のディレクトリは常に属性文字Dを持ちます。

source: Note that for DropDownLists and ComboBoxes, H is the combined height of the control's always-visible portion and its list portion (but even if the height is set too low, at least one item will always be visible in the list).
ja: なお、DropDownListとComboBoxの場合、Hはコントロールの常時表示部分とリスト部分の高さを合わせた値です（ただし、高さを低く設定しても、少なくとも1つのアイテムは常にリスト内に表示されます）。

source: Note that if a Click event callback is registered, the HREF attribute is not automatically executed.
ja: なお、クリックイベントコールバックが登録されている場合、HREF属性は自動的に実行されません。

source: Note that in the first 5 iterations of the loop, the Continue statement causes the loop to start over before it reaches the MsgBox line.
ja: ループの最初の5回の繰り返しでは、MsgBox行に到達する前にContinue文によってループがやり直されていることに注意してください。

source: Note that in this case the MsgBox function call must be specified with parentheses.
ja: この場合、MsgBox関数呼び出しは括弧で指定する必要があることに注意してください。

source: Note that key-repeat occurs even for modifier keys and even after sending other keys, but only for the last physically pressed key.
ja: なお、キーリピートは修飾キーでも、他のキー送信後でも発生しますが、最後に物理的に押されたキーに対してのみ発生します。

source: Note that most object-oriented C++ functions use the thiscall convention, which is not supported.
ja: なお、オブジェクト指向のC++関数の多くはthiscallの規約を使用していますが、これはサポートされていません。

source: Note that named subpatterns are also numbered, so if an unnamed subpattern occurs after "Year", it would be stored in OutputVar[2], not OutputVar[1].
ja: 名前付きサブパターンにも番号が振られるため、「Year」の後に名前なしサブパターンが発生した場合、OutputVar[1]ではなくOutputVar[2]に格納されることに注意しましょう。

source: Note that once the message box is dismissed, the script will continue as usual.
ja: なお、メッセージボックスが解除されると、スクリプトは通常通り実行されます。

source: Note that searches such as DirExist("FolderWithFilesAndSubfolders\*") only tells you whether a folder exists.
ja: DirExist("FolderWithFilesAndSubfolders*")のような検索では、フォルダが存在するかどうかしかわからないことに注意してください。

source: Note that some cases are newly detected as invalid, such as 0**0 and a<<b or a>>b where b is not in the range 0..63.
ja: なお、0**0や a<<b、a>>bのようにbが0.63の範囲にない場合は、新たに無効と判断される場合があります。

source: Note that some windows (e.g. certain versions of MS Word) report the same caret position regardless of its actual position.
ja: 一部のウィンドウ（MS Wordの特定のバージョンなど）では、実際の位置に関係なく、同じキャレット位置を報告することに注意してください。

source: Note that the statements must appear beneath the abbreviation within the hotstring's function body:
ja: ステートメントは、ホットストリングの関数本体の略語の下に記述する必要があることに注意してください：

source: Note that the String parameter is always assumed to use the native encoding of the current executable, whereas Encoding specifies the encoding of the string written to the given Target.
ja: Stringパラメータは常に現在の実行ファイルのネイティブエンコーディングを使用すると仮定されるのに対し、Encodingは指定されたTargetに書き込まれる文字列のエンコーディングを指定することに注意してください。

source: Note that the functions must appear beneath the hotstring:
ja: なお、関数はホットストリングの下に表示する必要があります。

source: Note that the loop always has at least one iteration unless String is empty or DelimiterChars is omitted and all characters in String are included in OmitChars.
ja: なお、Stringが空であるか、DelimiterCharsが省略され、Stringのすべての文字がOmitCharsに含まれない限り、ループは常に少なくとも1回繰り返されます。

source: Note that the loop always has at least one iteration unless String is empty or Delimiters is omitted and all characters in String are included in OmitChars.
ja: なお、Stringが空であるか、Delimitersが省略され、Stringのすべての文字がOmitCharsに含まれない限り、ループは常に少なくとも1回繰り返されます。

source: Note that the parentheses after "WinWait" are required when we want to use the function's result in an expression (such as the condition of an if statement).
ja: なお、「WinWait」の後の括弧は、関数の結果を式（if文の条件など）で使用したい場合に必要です。

source: Note that the return value is always in the native encoding of the current executable, whereas Encoding specifies how to interpret the string read from the given Source.
ja: 返り値は常に現在の実行ファイルのネイティブ・エンコーディングであることに注意してください。一方、Encodingは与えられたSourceから読み込まれた文字列をどのように解釈するかを指定します。

source: Note that the second parameter may have no effect at all on newer systems.
ja: なお、2番目のパラメータは、新しいシステムではまったく効果がない場合があります。

source: Note that the sleep key on some keyboards might not work with this.
ja: なお、キーボードによってはスリープキーが効かないことがあります。

source: Note that the space between an "ahk_" keyword and its criterion value can be omitted; this is especially useful when using variables, as shown by the second WinActive.
ja: 「ahk_」キーワードとその基準値の間のスペースは省略できることに注意してください。

source: Note that the space between an "ahk_" keyword and its criterion value can be omitted; this is especially useful when using variables, as shown by the second WinExist.
ja: 「ahk_」キーワードとその基準値の間のスペースは省略可能であることに注意してください。

source: Note that the system implements its own timeout, defined by the DWORD value LowLevelHooksTimeout in the following registry key:
ja: なお、システムは独自のタイムアウトを実装しており、以下のレジストリキーにあるDWORD値LowLevelHooksTimeoutで定義されています：

source: Note that these codes must be in hexadecimal.
ja: なお、これらのコードは16進数である必要があります。

source: Note that this also causes any programs launched by the script to run as administrator, and may require the user to accept an approval prompt when launching the script.
ja: この場合、スクリプトによって起動されるすべてのプログラムが管理者として実行され、スクリプトの起動時に承認プロンプトを受け入れるようユーザーに要求される場合があることに留意してください。

source: Note that this applies only to script files loaded by AutoHotkey, not to file I/O within the script itself.
ja: これは、AutoHotkeyによってロードされたスクリプトファイルにのみ適用され、スクリプト自体のファイルI/Oには適用されないことに注意してください。

source: Note that this code must be in hexadecimal.
ja: なお、このコードは16進数である必要があります。

source: Note that this does not necessarily occur for continuable errors, but throw is never continuable.
ja: これは継続可能なエラーでは必ずしも起こらないが、スローは決して継続できないことに注意。

source: Note that this function expects filename paths to contain backslashes (\) only and URLs to contain forward slashes (/) only.
ja: この関数は、ファイル名のパスにはバックスラッシュ(\)だけを、URLにはフォワードスラッシュ(/)だけを含むことを想定していることに注意してください。

source: Note that this functionality is disabled for compiled scripts which are based on a BIN file.
ja: この機能は、BINファイルに基づいてコンパイルされたスクリプトには無効であることに注意してください。

source: Note that this is not the same as a Prog ID (a Prog ID is a name used to identify the class in the system registry, or for ComObject).
ja: Prog IDとは異なることに注意してください（Prog IDはシステムレジストリでクラスを識別するために使用する名前、またはComObjectのための名前です）。

source: Note that this probably won't work well on Windows 10 for reasons described above.
ja: なお、上記の理由により、ウィンドウズ10ではおそらくうまくいかないだろう。

source: Note that two displays can have the same bit depth, but different color formats.
ja: 2つのディスプレイはビット深度が同じでもカラーフォーマットが異なることがあることに注意。

source: Note that we use ahk_class so that the example will work on non-English systems, but you can remove it and use the window's title if you wish.
ja: なお、この例では英語以外のシステムでも動作するようにahk_classを使用していますが、必要であればこれを削除してウィンドウのタイトルを使用することも可能です。

source: Note that with an odd number of consecutive colons, the previous behaviour did not consider the final colon as part of a pair.
ja: なお、コロンが奇数個連続する場合、以前の動作では最後のコロンがペアの一部とみなされませんでした。

source: Note the lack of a comma between X and Y.
ja: XとYの間にコンマがないことに注意してください。

source: Note: SetWorkingDir has no effect on #DllLoad because #DllLoad is processed before the script begins executing.
ja: 注：SetWorkingDirは、スクリプトの実行を開始する前に#DllLoadが処理されるため、#DllLoadには影響しません。

source: Note: SetWorkingDir has no effect on #Include because #Include is processed before the script begins executing.
ja: 注：SetWorkingDirは、スクリプトの実行を開始する前に#Includeが処理されるため、#Includeに影響を与えません。

source: Note: Slow takes precedence over Alt, so there is no need to specify Alt in this case.
ja: 注：Slowは Altより優先されるので、この場合はAltを指定する必要はありません。

source: Note: Changing the icon will not unhide the tray icon if it was previously hidden by means such as #NoTrayIcon; to do that, use A_IconHidden := false.
ja: 注：A_IconHidden := falseを使って変更しても、トレイアイコンが#NoTrayIconなどで非表示になっていた場合は、非表示は解除されません。

source: Note: Changing the working directory in this way does not affect the script's initial working directory when it starts running (A_WorkingDir).
ja: 注：この方法で作業ディレクトリを変更しても、スクリプトの実行開始時の初期作業ディレクトリ（A_WorkingDir）には影響しない。

source: Note: For Xbox controller 2013 and newer (anything newer than the Xbox 360 controller), this script will only work if a window it owns is active, such as a message box, GUI, or the script's main window.
ja: 注：Xbox コントローラ 2013 以降（Xbox 360 コントローラより新しいもの）の場合、このスクリプトは、メッセージボックス、GUI、スクリプトのメインウィンドウなど、所有するウィンドウがアクティブな場合にのみ動作します。

source: Note: I'm using WinXP Pro (SP1) ... if you use a different OS then your params may change (only applicable to apps like Wordpad and Notepad that come with windows; for others the params shouldn't vary):
ja: 注：私はWinXP Pro (SP1)を使っています...もし違うOSを使っているなら、パラメータが変わるかもしれません（ワードパッドやメモ帳のようなウィンドウズ付属のアプリにのみ適用されます）：

source: Note: If more than one instance of a particular name matches something, only the leftmost one is stored.
ja: 注：特定の名前の複数のインスタンスが何かにマッチした場合、一番左にあるものだけが保存される。

source: Note: If the control has no visible caption text and no (single) text value, this property corresponds to the control's hidden caption text (like ControlGetText/ControlSetText).
ja: 注：コントロールに可視キャプションテキストがなく、（単一の）テキスト値もない場合、このプロパティはコントロールの非表示キャプションテキストに対応します（ControlGetText/ControlSetTextのように）。

source: Note: If the control is not value-capable, CurrentValue will be blank and assigning NewValue will raise an error.
ja: 注：コントロールが値対応でない場合、CurrentValueは空白となり、NewValueの代入はエラーとなります。

source: Note: If you are updating old code and get a TypeError due to passing an Integer to ComObject, it's likely that you should be calling ComValue instead.
ja: 注：古いコードを更新しているときに、ComObjectにIntegerを渡したためにTypeErrorが発生した場合、代わりにComValueを呼び出す必要がある可能性があります。

source: Note: If you press one of the hotkeys while the mouse cursor is hovering over a pixel that is invisible as a result of TransColor, the window visible beneath that pixel will be acted upon instead!
ja: 注：TransColorの結果不可視になったピクセルの上にマウスカーソルがあるときにホットキーのいずれかを押すと、そのピクセルの下に表示されているウィンドウが代わりに操作されます！

source: Note: In the absence of a preceding sign, a plus sign is assumed; for example, Wrap is the same as +Wrap.
ja: 注：先行する記号がない場合、プラス記号とみなされます。例えば、Wrapは +Wrapと同じです。

source: Note: On some versions of Windows, this style might not work properly if the GUI window is set to be always-on-top.
ja: 注：Windowsのバージョンによっては、GUIウィンドウが常に上に表示されるように設定されている場合、このスタイルが正しく動作しないことがあります。

source: Note: Since Edit and MonthCal controls have their own context menu, a right-click in one of them will not launch the ContextMenu event.
ja: 注：Editと MonthCalコントロールはそれぞれ独自のコンテキストメニューを持っているため、そのうちの1つを右クリックしてもContextMenuイベントは起動しません。

source: Note: The EXE file is produced using the same custom icon, .bin file and compression setting that were last saved in Method #1 above, or as specified by any relevant compiler directive in the script.
ja: 注：EXEファイルは、上記の方法#1で最後に保存したものと同じカスタムアイコン、.binファイル、圧縮設定、またはスクリプト内の関連するコンパイラディレクティブで指定されたものを使用して作成されます。

source: Note: The specified numbers must be less than 65536, and the first must be less than or equal to the second.
ja: 注：指定された数値は65536以下でなければならず、最初の数値は2番目の数値以下でなければならない。

source: Note: The word NOT is synonymous with ! except that ! has a higher precedence.
ja: 注：「NOT」は!と同義だが、!の方が優先順位が高い。

source: Note: There are apps with which this technique doesn't work.
ja: 注：このテクニックが使えないアプリもある。

source: Note: This option has no effect if the Classic Theme is in effect.
ja: 注：このオプションは、「クラシックテーマ」が有効な場合は効果がありません。

source: Note: This option is ignored when the "m" option is present.
ja: 注：「m」オプションがある場合、このオプションは無視される。

source: Note: To be effective, the window generally must not be minimized or hidden.
ja: 注：効果的に使用するためには、一般的にウィンドウを最小化または非表示にする必要はありません。

source: Note: To make an Edit control read-only, specify the string ReadOnly instead.
ja: 注：Editコントロールを読み取り専用にするには、代わりに文字列ReadOnlyを指定します。

source: Note: Unlike variables such as A_ThisHotkey, each thread retains its own value for A_EventInfo.
ja: 注：A_ThisHotkeyなどの変数とは異なり、各スレッドは、A_EventInfoの値を保持します。

source: Note: Use only one space or tab between the final option and the filename itself; any other spaces and tabs are treated as part of the filename.
ja: 注：最後のオプションとファイル名の間には、スペースまたはタブを1つだけ使用します。その他のスペースやタブは、ファイル名の一部として扱われます。

source: Note: While a script like this is running, the entire operating system and all applications are affected by timeBeginPeriod below.
ja: 注：このようなスクリプトが実行されている間、オペレーティング・システム全体とすべてのアプリケーションは、以下のtimeBeginPeriodの影響を受ける。

source: Note: adding icons to a ListView's rows will increase the height of each row, which will make this option inaccurate.
ja: 注：ListViewの行にアイコンを追加すると、各行の高さが高くなるため、このオプションは不正確となります。

source: Note: the variable will auto-expand if the script assigns it a larger value later.
ja: 注：この変数は、スクリプトが後で大きな値を代入した場合に自動的に拡張されます。

source: Note: the window must have +Resize to allow resizing by the user.
ja: 注：の場合、ユーザーによるサイズ変更を可能にするために、ウィンドウには+Resizeが必要です。

source: Notepad++ DBGp Plugin
ja: Notepad++ DBGpプラグイン

source: Notepad++ becomes unstable if property_get fails, which is particularly problematic in light of the above.
ja: property_getに失敗するとNotepad++が不安定になるので、上記の点を考慮すると特に問題です。

source: Notepad++ can be configured to support the following features:
ja: メモ帳++は以下の機能をサポートするように設定できます：

source: Notepad2-zufuliu supports the following for AutoHotkey v2 by default:
ja: Notepad2-zufuliu はデフォルトでAutoHotkey v2の以下の機能をサポートしています：

source: Notes
ja: 注釈

source: Notes:
ja: 注：

source: Notice that I added parentheses around the window title, immediately following the function name.
ja: ウィンドウのタイトルを括弧で囲み、関数名の直後に括弧を付けていることに注目してください。

source: Notice that any code after the closing parenthesis is also joined with the other lines (without any delimiter), but the opening and closing parentheses are not included.
ja: 閉じ括弧の後のコードも（区切り記号なしで）他の行と結合されるが、開き括弧と閉じ括弧は含まれないことに注意。

source: NotifyNonText is applied to key-up events by considering whether a previous key-down with a matching VK code was classified as text or non-text.
ja: NotifyNonText は、VK コードが一致する前のキーダウンがテキストと非テキストのどちらに分類されるかを考慮して、キーアップイベントに適用されます。

source: Now WordPad launches, but it shows an error:
ja: これでWordPadは起動するのですが、エラーが表示されます。

source: Now WordPad launches, but it shows an error: "C:\Program" wasn't found.
ja: これでWordPadは起動するのですが、エラーが表示されます：「C:\Program」は見つかりませんでした。

source: Now go to the "New Message" window and select from its menu bar:
ja: "新規メッセージ"ウィンドウに移動し、メニューバーから選択する：

source: Now go to the "New Message" window and select from its menu bar: Insert > Picture.
ja: 「新規メッセージ」ウィンドウに移動し、メニューバーから選択する：Insert > Picture。

source: Now it is treated as a read-only built-in variable in all cases.
ja: これで、すべてのケースで読み取り専用の組み込み変数として扱われるようになりました。

source: Now let me tell you how to find a value such as 40239:
ja: では、40239のような値を見つける方法を説明しよう：

source: Now let's say it's an app where you have to select a tool from a toolbar using AutoHotkey; say the dropper tool is to be selected.
ja: ここで、AutoHotkeyを使ってツールバーからツールを選択するアプリを考えてみよう。

source: Now put that in the above function and you've got it!
ja: これを上記の関数に入れれば完成です！

source: Now suppose that we want to open the file in WordPad instead of Notepad.
ja: ここで、メモ帳ではなく、WordPadでファイルを開きたいとします。

source: Now the parameter can be defined as &bCancel and assigned like bCancel := true; or can be defined as pbCancel and assigned like %pbCancel% := true.
ja: これで、パラメータを&bCancelと定義してbCancel := trueのように代入することも、pbCancelと定義して%pbCancel% := trueのように代入することもできるようになりました。

source: Now you can activate your test subject and press Ctrl+1 to maximize it.
ja: これで、対象ウインドウをアクティブにして、Ctrl+1を押して最大化することができます。

source: Now, to make Numpad0 send a real Numpad0 keystroke whenever it wasn't used to launch a hotkey such as the above, add the following hotkey:
ja: さて、Numpad0が上記のようなホットキーの起動に使われなかったときは、いつでも本物のNumpad0のキーストロークを送るようにするには、以下のホットキーを追加してください：

source: Num := 6 ; Assign a number to a variable.
ja: Num := 6 ; 変数に数値を代入します。

source: NumGet - Syntax & Usage | AutoHotkey v2
ja: NumGet - 構文と使用法｜AutoHotkey v2

source: NumPut - Syntax & Usage | AutoHotkey v2
ja: NumPut - 構文と使用法｜AutoHotkey v2

source: NumPut's parameters were reordered to allow a sequence of values, with the (now mandatory) type string preceding each number.
ja: NumPutのパラメータは、値の並びを変更し、各数値の前に（現在は必須の）タイプ文字列を置くことができるようになった。

source: Number - Syntax & Usage | AutoHotkey v2
ja: Number - 構文と使用法｜AutoHotkey v2

source: Number assignment
ja: 番号割り当て

source: Number is actually a class, but can be called as a function.
ja: Numberは実際にはクラスですが、関数として呼び出すことができます。

source: Number of buttons on mouse (0 if no mouse is installed).
ja: マウスのボタン数（マウスがインストールされていない場合は0）。

source: Number of display monitors on the desktop (not including "non-display pseudo-monitors").
ja: デスクトップ上のディスプレイモニターの数（「非ディスプレイ疑似モニター」は含まない）。

source: Number of pixels per logical inch along the screen width.
ja: 画面幅に沿った1論理インチあたりのピクセル数。

source: Numbers
ja: 数字

source: Numbers are not supported.
ja: 数字はサポートされていない。
